{"so when i was trying to get into Vero this morn i had to keep resending the confirmation code/requesting a call. got in a lil later thanks to texts finally coming thru. as i type this, Vero has called me for the FIFTH time within an hour. please dont make me answer my phone":"probably just lag from the requests i put in earlier but holy SHIT calls and strange numbers stress me the fuck out","Amazing that young people aren’t dying of old age. https://t.co/YAkRDbUaBi":"@BrooklynBrett @redsteeze That's a strange way of highlighting the effectiveness of the US healthcare system. Now do car accidents and drug overdoses.","@IanMCohen @nazosan2 @thepr0diga1s0n @MikeDrucker @JoeNBC @davidhogg111 @FedEx Once again government is your answer.":"@philboldt @nazosan2 @thepr0diga1s0n @MikeDrucker @JoeNBC @davidhogg111 @FedEx So the founding fathers were right about guns but wrong about a free and public education? Strange thought pattern you have their.","Have you caught something scary or mysterious on video? Tweet me the link! We're putting together a list of purely user submitted videos :)":"@YT_Chills Got a strange EVP this one time...\nhttps://t.co/NKwYfNHYMG","Lahore Lit Fest.  Media meet.  My Urdu has improved ! https://t.co/zcas1UMN4M":"@DeShobhaa But your Hindi has deteriorated and so has your nationalism, but you have a right to do whatever you want, I just hope that you one day go there and don't want to come back. Strange you are neither literary nor media.","Grief wears many faces...  https://t.co/EIKQby8SuV":"@RealJamesWoods I think they should keep an eye on these kids , they probably should be mourning not celebrating. Strange..","@Luke4Games Bayonetta. Really pointless the way you have a continue option in a boss fight as it serves no purpose at all.\n\nIf you have the Halos which you should do you may as well select quit to stock up on items then try again.\n\nIdk it genuinely really irritates me.":"@OriBlind_Forest it’s a strange option to put in for sure","@adalyfrey @wiley77 @RBaroff427 @BmessDFS Can we make \"weirdest blocked accounts\" a thing? For me it has to be one of these two https://t.co/gmtcZuFq1l":"@CoryPunter @adalyfrey @wiley77 @BmessDFS You Canadians are a strange people.","“And now the sun’s coming up...” on another A’s broadcast season.  A’s-Padres today with Vince, Ray and me at noon Pacific/11:30 pregame on 95.7 The Game and A’s Radio Network. https://t.co/qfbhguTggo":"@KenKorachRadio A's fans. Few in number, but fiercly loyal. It's strange going into a season where hitting should be sound, pitching the question mark.","@0nAWhiteHorse For centuries, she has walked this earth and has never wished to spend any time with any mortal as she does with him.  Although, he is not really a mortal, is he?  Regardless, she smiles at him again before leading him from the room and down the stairs. The take the same path-":"@0nAWhiteHorse that the Naiad had taken just days before, until they are in the cellar.  Stopping at the door, she presses her hand to it and turns to face him again.  \n\"This will feel strange to you, but do not release my hand, no matter what you feel.  Hold to me.\"","NOBODY joins the NRA for rental car discounts. 5 million voices will not be silenced by this relentless economic war on liberty-loving American patriots. We were born for this fight &amp; we NEVER forget. Boycotts work both ways. You’re playing the short game. We’re in this forever.":"@dbongino When killing is permissible then think it not strange when a disobedient child takes a rifle and slaughters 17 people in a school. It’s not a gun problem. It is a human problem. We can’t spank or discipline but the result are children that can’t be controlled.","@ivordocumentary He was briefly a ghost writer for Houdini!":"@LeavittAlone Wow! I did not know that. This is really strange, b/c Lovecraft was a rabid anti-Semite, yet he married a Jewish emigre and then worked for a famous Jewish (Viennese) performer, Houdini.\nHPL was also a germophobe, so he definitely had lots of issues.","@suspect_black @TheAcronymMaker One of the ways the powers that be control the masses of the world is by keeping us always at odds against each other over race even though we all are debt slaves. Some of us just don't know it but we are ALL in this together.":"@UncleSal07 @TheAcronymMaker Uncle Sal,explain why Christianity, Islam, Hindu&amp;Judaism determined that the AFRIKAN is at the bottom of\"gods\" grace, damned to the pitts of society's? Just seems strange that earths 1st people god hates. Maybe god does make mistakes?","T 2625 - न जाने क्यूँ , एक अजीब सी घबराहट हो रही है  !!":"@SrBachchan T 2625 - Do not know, a strange nervousness is happening !!"}